i just recognize that the kubernetes provider on version `1.10.0` sets the `id` of the resources as the `name` with a `/` prefix (see last lines of terminal output).  

```
Terraform will perform the following actions:

  # kubernetes_priority_class.high_priority will be created
  + resource "kubernetes_priority_class" "high_priority" {
      + global_default = false
      + id             = (known after apply)
      + value          = 200

      + metadata {
          + generation       = (known after apply)
          + name             = "high-priority"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_priority_class.low_priority will be created
  + resource "kubernetes_priority_class" "low_priority" {
      + global_default = false
      + id             = (known after apply)
      + value          = 100

      + metadata {
          + generation       = (known after apply)
          + name             = "low-priority"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_priority_class.mid_priority will be created
  + resource "kubernetes_priority_class" "mid_priority" {
      + global_default = false
      + id             = (known after apply)
      + value          = 150

      + metadata {
          + generation       = (known after apply)
          + name             = "mid-priority"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

kubernetes_priority_class.low_priority: Creating...
kubernetes_priority_class.mid_priority: Creating...
kubernetes_priority_class.high_priority: Creating...
kubernetes_priority_class.high_priority: Creation complete after 1s [id=/high-priority]
kubernetes_priority_class.mid_priority: Creation complete after 1s [id=/mid-priority]
kubernetes_priority_class.low_priority: Creation complete after 2s [id=/low-priority]
```